Merge release/v1.5.2 into main
